import re
import os
import requests

from fontTools.ttLib import TTFont

from CSS_.str_dict import cookie_conv

basefont_char = [
     '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大', '市', '公', '酒',
     '行', '国', '品', '发', '电', '金', '心', '业', '商', '司', '超', '生', '装', '园', '场', '食', '有', '新', '限', '天', '面',
     '工', '服', '海', '华', '水', '房', '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺', '花', '专', '东', '肉', '菜',
     '学', '福', '饭', '人', '百', '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药', '银', '农', '龙', '停', '尚', '安',
     '广', '鑫', '一', '容', '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤', '文', '康', '信', '果', '阳', '理', '锅',
     '宝', '达', '地', '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳', '化', '五', '米', '修', '爱', '北', '养', '卖',
     '建', '材', '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名', '丽', '油', '院', '堂', '烧', '江', '社', '合', '星',
     '货', '型', '村', '自', '科', '快', '便', '日', '民', '营', '和', '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
     '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销', '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋', '辣',
     '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上', '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正', '造', '丰',
     '健', '点', '汤', '网', '庆', '技', '斯', '洗', '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川', '泰', '色', '世',
     '方', '寓', '风', '幼', '羊', '烫', '来', '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成', '云', '维', '贸', '道',
     '术', '运', '都', '口', '博', '河', '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培', '力', '惠', '连', '马', '鸿',
     '钢', '训', '影', '甲', '助', '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑', '沙', '恒', '隆', '春', '干', '饼',
     '氏', '里', '二', '管', '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计', '黄', '讯', '太', '鸭', '号', '街', '交',
     '与', '叉', '附', '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖', '段', '乡', '厦', '府', '铺', '内', '侧', '元',
     '购', '前', '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开', '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政',
     '步', '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双', '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
     '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪', '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边', '济',
     '井', '办', '汉', '代', '临', '弄', '团', '外', '塔', '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进', '荣', '友',
     '虹', '央', '桂', '沿', '事', '津', '凯', '莲', '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是', '不', '了', '很',
     '还', '个', '也', '这', '我', '就', '在', '以', '可', '到', '错', '没', '去', '过', '感', '次', '要', '比', '觉', '看', '得',
     '说', '常', '真', '们', '但', '最', '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为', '欢', '然', '他', '挺', '着',
     '价', '那', '意', '种', '想', '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜', '度', '起', '满', '给', '热', '完',
     '格', '荐', '喝', '等', '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而', '买', '于', '般', '豆', '量', '选', '奶',
     '打', '每', '评', '少', '算', '又', '因', '情', '找', '些', '份', '置', '适', '什', '蛋', '师', '气', '你', '姐', '棒', '试',
     '总', '定', '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝', '主', '话', '强', '当', '更', '板', '知', '己', '无',
     '酸', '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像', '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
     '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟', '块', '调', '糕'
                ]
url = "https://www.dianping.com/search/keyword/1/0_%E9%85%92%E5%90%A7"
headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.67 Safari/537.36 Edg/87.0.664.55",
    "Referer": "http://www.dianping.com/shanghai",
    "Host": "www.dianping.com",
    "Sec-Fetch-Dest": "document",
    "Sec-Fetch-Mode": "navigate",
    "Sec-Fetch-Site": "same-origin",
    "Sec-Fetch-User": "?1",
    "Upgrade-Insecure-Requests": "1"
}
cookies_str = "_lxsdk_cuid=1762322ab90c8-0412c953aeeeb1-5a30134f-144000-1762322ab90c8; _lxsdk=1762322ab90c8-0412c953aeeeb1-5a30134f-144000-1762322ab90c8; _hc.v=18a8923e-50cb-9dc4-28a1-2e218ac1d78d.1606907244; fspop=test; cy=1; cye=shanghai; s_ViewType=10; dplet=8395514ac05081351d0ea57716b3d9cb; dper=51f0c3d9355b4d269f6e56ed912693ab7024c6af071d21bff2bf637459f8854677c52284381aaa3e4cbca2014bd18b9a3b4b00f1c701c38ba0531d13e9d857ae2cfeee1f89485d0a0d13e813835c7c954c4dbc62629fe9b16fb76df646d7ad8c; ua=dpuser_6389924336; ctu=cd37ac14f06f6366d2e24016eff53eb17c74479f4a3fb69551a9ec14ec363765; ll=7fd06e815b796be3df069dec7836c3df; _lx_utm=utm_source%3DBaidu%26utm_medium%3Dorganic; Hm_lvt_602b80cf8079ae6591966cc70a3940e7=1607223475,1607262741,1607400082,1607400547; Hm_lpvt_602b80cf8079ae6591966cc70a3940e7=1607404521; _lxsdk_s=17640c683ed-390-c42-4e1%7C%7C21"
cookies_dict = cookie_conv(cookies_str)
response = requests.get(url=url, headers=headers, cookies=cookies_dict)
# 找到加密字体
word_list = re.findall(r'&#x\w+', response.text)
# 下载新的CSS字体库
css_response = requests.get("https:" + re.search(r'href="(//s3.*.css)', response.text).group(1))
woff_url = re.findall(r'opentype"\),url\("(//s3plus.*?woff)"', css_response.text)
for url in woff_url:
    url = 'http:' + url
    woff_content = requests.get(url).content
    woff_name = url.split('/')[-1]
    font = TTFont(woff_name)



    if not os.path.exists(woff_name):
        with open(woff_name, 'wb') as f:
            f.write(woff_content)
            print(woff_name + "下载成功")
            # 导入字体文件转换成xml




print(word_list)
# for word in word_list:
#     #